ffmpeg-gif.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-12-13 Tue 23:06 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>generating gif's with ffmpeg</title>
<meta name="generator" content="Org Mode" />
<meta charset="UTF-8">
<nav>
<a href="index.html">home</a> /
<a href="about.html">about</a> /
<a href="sitemap.html">sitemap</a> /
</nav>
</head>
<body>
<div id="content" class="content">
<h1 class="title">generating gif's with ffmpeg</h1>
<p>
gif is really a horrible format, avoid it if you can. <a href="./ffmpeg-webp.html">webp</a> is a much
nicer format if you insist on using an image, but dedicated video
formats will always be better.
</p>

<div id="outline-container-org0000000" class="outline-2">
<h2 id="org0000000"><span class="section-number-2">1.</span> single pass</h2>
<div class="outline-text-2" id="text-1">
<p>
this is the chonk maximum-quality method. it creates massive files
because palettes are not compressed.
</p>

<pre class="example" id="org0000000">
ffmpeg -i input.mkv -vf "split[s0][s1];[s0]palettegen[p];[s1][p]paletteuse" -loop 0 output.gif
</pre>
</div>
</div>

<div id="outline-container-org0000001" class="outline-2">
<h2 id="org0000001"><span class="section-number-2">2.</span> multi pass</h2>
<div class="outline-text-2" id="text-2">
<p>
multiple passes allows calculating a single, global, palette. this
allows the file size to be much smaller.
</p>

<p>
snippet mostly borrowed from <a href="http://blog.pkh.me/p/21-high-quality-gif-with-ffmpeg.html">pkh's blog</a>
</p>

<div class="org-src-container">
<pre class="src src-sh">#!/bin/sh

palette="/tmp/palette.png"
filters="fps=15,scale=320:-1:flags=lanczos"

ffmpeg -i "$1" -vf "$filters,palettegen" -y "$palette"
ffmpeg -i "$1" -i $palette -lavfi "$filters [x]; [x][1:v] paletteuse" -y "$2"
</pre>
</div>
</div>
</div>
</div>
</body>
</html>
